export const TYPE_CODE_MAPPING = {
  // 动车
  I: "一等卧(软卧/动卧)-上铺-同",
  J: "二等卧(硬卧)-上铺-同",

  I3: "一等卧(软卧/动卧)-上铺",
  I1: "一等卧(软卧/动卧)-下铺",
  J3: "二等卧(硬卧)-上铺",
  J2: "二等卧(硬卧)-中铺",
  J1: "二等卧(硬卧)-下铺",

  // 高铁
  M: "一等座",
  O: "二等座/无座",
  "9": "商务座(特等座)",

  // 普通列车
  "4": "一等卧(软卧/动卧)-上铺-同",
  "3": "二等卧(硬卧)-上铺-同",
  "1": "硬座/无座",

  "63": "高级软卧-上铺",
  "61": "高级软卧-下铺",
  "43": "一等卧(软卧/动卧)-上铺",
  "41": "一等卧(软卧/动卧)-下铺",
  "33": "二等卧(硬卧)-上铺",
  "32": "二等卧(硬卧)-中铺",
  "31": "二等卧(硬卧)-下铺",
} as const;

export const SITE_TYPE = [
  { label: "商务座", value: "商务座" },
  { label: "一等座", value: "一等座" },
  { label: "二等座", value: "二等座" },
  { label: "硬座", value: "硬座" },
  { label: "硬卧", value: "硬卧" },
  { label: "软座", value: "软座" },
  { label: "软卧", value: "软卧" },
  { label: "无座", value: "无座" },
];
